 
# Yosys synthesis script for and2
# Read source files
verific -vlog-incdir 
verific -vlog-libdir 
verific -vlog-define 
verific -vlog2k /nfs_scratch/scratch/eda/behzad/bs/Raptor/tests/Testcases/and2_testcase/./rtl/and2.v
verific -import and2


# Technology mapping
hierarchy -top and2

setattr -set keep 1 w:\clk


plugin -i ql-qlf

synth_ql -family qlf_k6n10f -top and2  -no_dsp -no_bram -no_adder       -blif and2VErilog_post_synth.blif     


write_verilog -noattr -nohex and2VErilog_post_synth.v
  